Revit 2027 API
LeaderArray.Insert Method
Insert the specified item into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	Leader item,
	int index
)
Public Overridable Sub Insert (
	item As Leader,
	index As Integer
)
public:
virtual void Insert(
	Leader^ item,
	int index
)
abstract Insert :
        item : Leader *
        index : int -> unit
override Insert :
        item : Leader *
        index : int -> unit
Parameters
item Leader
The item to be inserted into the array.
index Int32
The item will be inserted before this index.
Return Value
Returns whether the item was inserted into the array.
See Also
Reference
LeaderArray Class
Autodesk.Revit.DB Namespace